#### 1.Write a python code to get the current date and time use split function to store data in variable "DATE" and time in variable "TIME"

In [17]:
from datetime import date,datetime
DATE=date.today()
now=datetime.now()
TIME=now.strftime("%H:%M:%S")
print("Current Date is: ",DATE)
print("Current Time is: ",TIME)

Current Date is:  2023-03-27
Current Time is:  18:47:52

#### 2.How Can You Check Wheather Pandas Dataframe is Empty or not

In [46]:
#check if DataFrame is empty and return output
import pandas as pd
df=pd.DataFrame([{"A":1,"B":2,"C":3}])
if len(df.index) == 0:
    print('df is empty')
else:
    print('df is not empty')

df is not empty

In [47]:
df

   A  B  C
0  1  2  3

##### Dataframe is empty'

In [49]:
import pandas as pd
df2=pd.DataFrame([])
if len(df2.index) == 0:
    print('DataFrame is empty')
else:
    print('Dataframe is not empty')

DataFrame is empty

In [51]:
df2

Empty DataFrame
Columns: []
Index: []

### 3. Write the python code to create the dataframe given below

##### We Create Dataframe

# Method 1

In [58]:
import pandas as pd
dict={"name":['vishnu',"Deepak","Ravi","Purushotam","Vivek","Guru"],
      "marks":[92,90,88,76,58,69],
      "city":["Jaypur","Rampur","Delhi","Noida","Indore","Shimla"]}
dataframe=pd.DataFrame(dict)
dataframe

         name  marks    city
0      vishnu     92  Jaypur
1      Deepak     90  Rampur
2        Ravi     88   Delhi
3  Purushotam     76   Noida
4       Vivek     58  Indore
5        Guru     69  Shimla

In [59]:
dataframe.loc[dataframe()]

TypeError: 'DataFrame' object is not callable

# Method 2

In [1]:
import pandas as pd
df=pd.DataFrame([{"Name":"Jai","Age":"24","Address":"Delhi","Qualification":"Msc"},
                 {"Name":"Princi","Age":"27","Address":"Kanpur","Qualification":"MA"},
                 {"Name":"Gaurav","Age":"22","Address":"Allahabad","Qualification":"MCA"},
                 {"Name":"Anuj","Age":"32","Address":"Kannauj","Qualification":"Phd"},
                 {"Name":"Geeku","Age":"15","Address":"Noida","Qualification":"10"},
                 {"Name":"Vishnu","Age":"18","Address":"Noida","Qualification":"BCA"}])

In [2]:
df

     Name Age    Address Qualification
0     Jai  24      Delhi           Msc
1  Princi  27     Kanpur            MA
2  Gaurav  22  Allahabad           MCA
3    Anuj  32    Kannauj           Phd
4   Geeku  15      Noida            10
5  Vishnu  18      Noida           BCA

In [21]:
h=df["Qualification"]
print(h[3])

Phd

In [31]:
df["Filter"]=df["Age"]>='30'
df

     Name Age    Address Qualification  Filter
0     Jai  24      Delhi           Msc   False
1  Princi  27     Kanpur            MA   False
2  Gaurav  22  Allahabad           MCA   False
3    Anuj  32    Kannauj           Phd    True
4   Geeku  15      Noida            10   False
5  Vishnu  18      Noida           BCA   False

In [46]:
# Here We Select Particular/Multiple Rows which you want
df.loc[[5,1]]

     Name Age Address Qualification  Filter
5  Vishnu  18   Noida           BCA   False
1  Princi  27  Kanpur            MA   False

In [52]:
df.loc[0:5]

     Name Age    Address Qualification  Filter
0     Jai  24      Delhi           Msc   False
1  Princi  27     Kanpur            MA   False
2  Gaurav  22  Allahabad           MCA   False
3    Anuj  32    Kannauj           Phd    True
4   Geeku  15      Noida            10   False
5  Vishnu  18      Noida           BCA   False

In [58]:
df.loc[df["Age"]=="15",["Name","Age"]]

    Name Age
4  Geeku  15

In [79]:
df

     Name Age    Address Qualification
0     Jai  24      Delhi           Msc
1  Princi  27     Kanpur            MA
2  Gaurav  22  Allahabad           MCA
3    Anuj  32    Kannauj           Phd
4   Geeku  15      Noida            10
5  Vishnu  18      Noida           BCA

# Transfrom

In [62]:
df.T

                   0       1          2        3      4       5
Name             Jai  Princi     Gaurav     Anuj  Geeku  Vishnu
Age               24      27         22       32     15      18
Address        Delhi  Kanpur  Allahabad  Kannauj  Noida   Noida
Qualification    Msc      MA        MCA      Phd     10     BCA

##### Covert pandas dataframe to excel sheet

In [5]:
dataframe.to_csv("friends.csv")

In [63]:
import numpy as np
str=pd.Series(np.random.rand(34))# Series
data=pd.DataFrame(np.random.rand(334,5),index=np.arange(334)) # DataFrame
type(data)

pandas.core.frame.DataFrame

#### >i Write the code to filter the data where age is between 20 to 30.

In [84]:
df.loc[(df["Age"]>'20') &(df["Age"]<'30')]

     Name Age    Address Qualification
0     Jai  24      Delhi           Msc
1  Princi  27     Kanpur            MA
2  Gaurav  22  Allahabad           MCA

##### ii> Write the code to filter the data where Address is Delhi And Noida

In [95]:
df

     Name Age    Address Qualification
0     Jai  24      Delhi           Msc
1  Princi  27     Kanpur            MA
2  Gaurav  22  Allahabad           MCA
3    Anuj  32    Kannauj           Phd
4   Geeku  15      Noida            10
5  Vishnu  18      Noida           BCA

In [133]:
de=df.loc[(df["Address"]=="Noida")]
f=df.loc[(df["Address"]=="Delhi")]
de

     Name Age Address Qualification
4   Geeku  15   Noida            10
5  Vishnu  18   Noida           BCA

In [134]:
f

  Name Age Address Qualification
0  Jai  24   Delhi           Msc

In [137]:
# de=df.loc[(df["Address"]=='Delhi',"Noida")]

KeyError: 'Noida'

##### iii> Write the code to filter data with heighest qualification and heighest age

In [159]:
df.loc[(df["Qualification"]>'30') &(df["Age"]>'30')]

   Name Age  Address Qualification
3  Anuj  32  Kannauj           Phd

In [160]:
df

     Name Age    Address Qualification
0     Jai  24      Delhi           Msc
1  Princi  27     Kanpur            MA
2  Gaurav  22  Allahabad           MCA
3    Anuj  32    Kannauj           Phd
4   Geeku  15      Noida            10
5  Vishnu  18      Noida           BCA

### 4.Write the Output
mylist=[2,4,5,7,8,6,1]
print([x+1 for x in mylist])

In [161]:
mylist=[2,4,5,7,8,6,1]
print([x+1 for x in mylist])

[3, 5, 6, 8, 9, 7, 2]

In [179]:
mylist=[2,4,5,7,8,6,1]
for x in mylist:
    mylist=(x+1)
    print(mylist)

3
5
6
8
9
7
2

### 5.Write the output
Print([i+1.5 for i in range (0,5)])

In [240]:
Print([i+1.5 for i in range (0,5)]) ### This is Name Error Because Here P is in Capital Letter

NameError: name 'Print' is not defined

In [183]:
print([i+1.5 for i in range (0,5)])# Correct Answer

[1.5, 2.5, 3.5, 4.5, 5.5]

In [195]:
for i in range(0,5):
    u=i+1.5
    print(u)

1.5
2.5
3.5
4.5
5.5

### 6.Write the output
myDict={"Pen":10,"Pencil":20,"Eraser":25}

myDict={}

print("Dictionary Length= ",len(myDict))

In [196]:
myDict={"Pen":10,"Pencil":20,"Eraser":25}
myDict={}
print("Dictionary Length= ",len(myDict))

Dictionary Length=  0

#### 07.Write the Code to get smallest and the largest from the list given below:
[10,20,30,9,2,44,66,11,42]

In [199]:
# Solution
a=[10,20,30,9,2,44,66,11,42]
print("Maximum Number is Given the list is: ",max(a))
print("Minimum Number is Given the list is: ",min(a))

Maximum Number is Given the list is:  66
Minimum Number is Given the list is:  2

### 8. Write a code for make a dictionary of odd number till 10 as key and values will be the square of keys also seprate the keys and store in two different list

In [250]:
number = int(input("Please enter the Maximum Number : "))
myDict = {}

for x in range(1, number + 1):
    myDict[x] = x * x
if number%2 !=0:
    print("\nDictionary = ", myDict)
else:
    print("You Enter Even Number")

Dictionary =  {1: 1, 2: 4, 3: 9, 4: 16, 5: 25}